app/views/publications/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label "Categoria" %><br>
    <%= f.select :category_id, Category.all.collect {|category| [ category.name, category.id ] } %>