app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2016-07-10 14:14:16.495685"], ["updated_at", "2016-07-10 14:14:16.495685"]]

  def update
      if @category.update(category_params)
---
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "asodk"], ["updated_at", "2016-07-10 15:18:44.623851"], ["id", 1]]

    def set_category
      @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 2]]