app/controllers/homes_controller.rb

  def index
    @publications = Publication.all
---
SELECT "publications".* FROM "publications"