app/controllers/publications_controller.rb

SELECT "publications".* FROM "publications"
---
  def index
    @publications = Publication.all

INSERT INTO "publications" ("title", "description", "publication_image", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Lutas"], ["description", "UFC"], ["publication_image", "_ndice.png"], ["category_id", 2], ["created_at", "2016-07-10 15:31:03.896810"], ["updated_at", "2016-07-10 15:31:03.896810"]]
---
  def create
    @publication = Publication.new(publication_params)

    if @publication.save

UPDATE "publications" SET "category_id" = ?, "updated_at" = ? WHERE "publications"."id" = ?  [["category_id", 2], ["updated_at", "2016-07-10 15:24:09.892768"], ["id", 5]]
---
  def update
      if @publication.update(publication_params)

DELETE FROM "publications" WHERE "publications"."id" = ?  [["id", 1]]
---
  def destroy
    @publication.destroy

SELECT  "publications".* FROM "publications" WHERE "publications"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_publication
      @publication = Publication.find(params[:id])